# Challenge

1. Establish a connection between Python and the Sakila database.

In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [5]:
password = getpass()

In [7]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)


2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [8]:
data = pd.read_sql_query('SELECT * FROM sakila.rental', engine) 
data

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

In [14]:
def rentals_month (engine, month, year):
    #SQL connection to retireve month and year
    query = f"SELECT * FROM rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}"

    #Get the data from the rental table using engine
    rental_data = pd.read_sql_query(query, engine)

    return rental_data

In [15]:
#checking the funtion 
rental_data_june_2005 = rentals_month(engine, month=6, year=2005)
rental_data_june_2005

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

In [22]:
def rental_count_month(rental_data, month, year):
    # Convert 'rental_date' column to datetime if it's not already in datetime format
    rental_data['rental_date'] = pd.to_datetime(rental_data['rental_date'])
    
    # Calculate rental counts by customer_id for the specified month and year
    rental_counts = rental_data[rental_data['rental_date'].dt.month == month]
    rental_counts = rental_counts[rental_counts['rental_date'].dt.year == year]
    rental_counts = rental_counts['customer_id'].value_counts().reset_index()
    rental_counts.columns = ['customer_id', f'rentals_{month:02d}_{year}']

    return rental_counts

In [23]:
#Runing the function with the given example
month = 5
year = 2005

rental_counts_may_2005 = rental_count_month(rentals_month(engine, month, year), month, year)

rental_counts_may_2005

     customer_id  rentals_05_2005
0            197                8
1            109                7
2            506                7
3            371                6
4            161                6
..           ...              ...
515          590                1
516          537                1
517          426                1
518          494                1
519           61                1

[520 rows x 2 columns]

4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [24]:
def compare_rentals(rental_counts_1, rental_counts_2):
    # Merge the two rental counts DataFrames on 'customer_id'
    merged_rental_counts = pd.merge(rental_counts_1, rental_counts_2, on='customer_id', how='outer')
    
    # Calculate the difference between the rental counts for the two months
    merged_rental_counts['difference'] = merged_rental_counts.iloc[:, 1] - merged_rental_counts.iloc[:, 2]
    
    return merged_rental_counts

In [31]:
#Checking the function
month_1 = 5
year_1 = 2005

month_2 = 6
year_2 = 2005

comparison_result = compare_rentals(rental_count_month(rentals_month(engine, month_1, year_1), month_1, year_1), rental_count_month(rentals_month(engine, month_2, year_2), month_2, year_2))
comparison_result

     customer_id  rentals_05_2005  rentals_06_2005  difference
0            197              8.0              8.0         0.0
1            109              7.0              5.0         2.0
2            506              7.0              5.0         2.0
3            371              6.0              7.0        -1.0
4            161              6.0              2.0         4.0
..           ...              ...              ...         ...
593          335              NaN              1.0         NaN
594          555              NaN              1.0         NaN
595          487              NaN              1.0         NaN
596          370              NaN              1.0         NaN
597           63              NaN              1.0         NaN

[598 rows x 4 columns]